FemDesign.Bars.Buckling.BucklingData.SetOnConcreteBar(FemDesign.Bars.Bar,FemDesign.Bars.Buckling.BucklingLength,FemDesign.Bars.Buckling.BucklingLength)
Set BucklingData on a Concrete bar-element.
Remarks: Action
bar: Bar. Concrete bar-element.
flexuralStiff: BucklingLength definition in Flexural Stiff direction.
flexuralWeak: BucklingLength definition in Flexural Weak direction.
Returns:

FemDesign.Bars.Buckling.BucklingData.SetOnSteelBar(FemDesign.Bars.Bar,FemDesign.Bars.Buckling.BucklingLength,FemDesign.Bars.Buckling.BucklingLength,FemDesign.Bars.Buckling.BucklingLength,FemDesign.Bars.Buckling.BucklingLength)
Set BucklingData on a Steel bar-element.
Remarks: Action
bar: Bar. Steel bar-element.
flexuralStiff: BucklingLength definition in Flexural Stiff direction.
flexuralWeak: BucklingLength definition in Flexural Weak direction.
pressuredFlange: BucklingLength definition for Pressured Flange.
pressuredBottomFlange: BucklingLength definition for Pressured Bottom Flange.
Returns:

FemDesign.Bars.Buckling.BucklingData.SetOnTimberBar(FemDesign.Bars.Bar,FemDesign.Bars.Buckling.BucklingLength,FemDesign.Bars.Buckling.BucklingLength,FemDesign.Bars.Buckling.BucklingLength)
Set BucklingData on a Timber bar-element.
Remarks: Action
bar: Bar. Timber bar-element.
flexuralStiff: BucklingLength definition in Flexural Stiff direction.
flexuralWeak: BucklingLength definition in Flexural Weak direction.
lateralTorsional: BucklingLength definition for Lateral Torsional Buckling.
Returns: